Revit 2025 API
PlasticvinylApplicationType Enumeration
 The enumerated type representing the permitted values for the asset property "PlasticvinylApplication" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PlasticvinylApplicationType
Public Enumeration PlasticvinylApplicationType
public enum class PlasticvinylApplicationType
type PlasticvinylApplicationType
Members
Member name | Value | Description
Polished | 0
Glossy | 1
Matte | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace